# Словарь с вопросами и ответами для викторины
questions = {
    "Что ты любишь больше всего делать?": {
        "A": {"text": "Плавать", "animal": "Дельфин"},
        "B": {"text": "Лазить по деревьям", "animal": "Обезьяна"},
        "C": {"text": "Лежать на травке", "animal": "Лев"}
    },
    "Ты лидер или ведомый?": {
        "A": {"text": "И то и то", "animal": "Дельфин"},
        "B": {"text": "Ведомый", "animal": "Обезьяна"},
        "C": {"text": "Лидер", "animal": "Лев"}
    },
    "Что ты любишь есть?": {
        "A": {"text": "Рыбу", "animal": "Дельфин"},
        "B": {"text": "Бананы", "animal": "Обезьяна"},
        "C": {"text": "Мясо", "animal": "Лев"}
    }
    # Другие вопросы
}

