
# Словарь с описаниями каждого животного
animals_descriptions = {
    "Дельфин": "Дельфин - это умное и социальное животное, которое обладает отличными плавательными навыками.",
    "Обезьяна": "Обезьяны известны своими интеллектуальными способностями и социальной организацией.",
    "Лев": "Лев - король животного мира, символ силы и мощи. Он является одним из самых крупных хищников в мире.",
    "Жираф": "Жираф - это высокое и изящное животное с длинной шеей, которое обычно обитает в саваннах Африки. Он является символом элегантности и грации.",
    "Бегемот": "Бегемот - крупное водоплавающее млекопитающее с массивным телом и короткими ногами. Оно обитает в реках, озерах и других водоемах Африки.",
    "Манул": "Манул - это маленький хищник, обитающий в горных регионах Центральной Азии. Он известен своим низким профилем и пушистой шерстью, а также за свой непривычный вид.",
    "Коала": "Коала - это маленькое, пушистое млекопитающее, которое обитает в Австралии. Оно известно своими большими круглыми глазами и любовью к эвкалиптовым листьям.",
    "Суслик": "Суслик - это небольшое грызуновидное животное, которое обитает в земляных норах. Оно известно своими короткими лапками, длинным телом и любопытным характером."
}

animals= {"Дельфин": 0, "Обезьяна": 0, "Лев": 0, "Жираф": 0, "Бегемот": 0, "Манул": 0, "Коала": 0, "Суслик": 0}


# Словарь с вопросами и ответами для викторины
questions = {
    "Какое место предпочитаешь для отдыха?": {
        "A": {"text": "На вершине дерева", "animal": "Коала"},
        "B": {"text": "Под землей, в норе", "animal": "Суслик"},
        "C": {"text": "В болоте, в окружении лилий", "animal": "Бегемот"}
    },

    "Что ты предпочитаешь делать в свободное время?": {
        "A": {"text": "Плавать в океане", "animal": "Дельфин"},
        "B": {"text": "Качаться на деревьях", "animal": "Коала"},
        "C": {"text": "Отдыхать в тени", "animal": "Лев"}
    },

    "Какой звук тебе больше нравится?": {
        "A": {"text": "Шелест листьев", "animal": "Коала"},
        "B": {"text": "Щебет птиц", "animal": "Суслик"},
        "C": {"text": "Пульсация дождя", "animal": "Бегемот"}
    },

    "Что ты любишь есть?": {
        "A": {"text": "Рыбу", "animal": "Дельфин"},
        "B": {"text": "Бананы", "animal": "Обезьяна"},
        "C": {"text": "Мясо", "animal": "Лев"}
    },

    "Какой ландшафт ты предпочитаешь для прогулок?": {
        "A": {"text": "Луга и поля", "animal": "Жираф"},
        "B": {"text": "Реки и водные пространства", "animal": "Бегемот"},
        "C": {"text": "Горы и холмы", "animal": "Манул"}
    },

    "Какой вид погоды ты предпочитаешь?": {
        "A": {"text": "Туман", "animal": "Коала"},
        "B": {"text": "Зной и жара", "animal": "Суслик"},
        "C": {"text": "Дождь", "animal": "Бегемот"}
    },

    "Какой сезон тебе ближе?": {
        "A": {"text": "Лето", "animal": "Жираф"},
        "B": {"text": "Осень", "animal": "Бегемот"},
        "C": {"text": "Зима", "animal": "Манул"}
    },

    "Где ты чувствуешь себя наиболее комфортно?": {
        "A": {"text": "В больших группах людей", "animal": "Жираф"},
        "B": {"text": "В одиночестве или в небольших компаниях", "animal": "Бегемот"},
        "C": {"text": " В окружении близких друзей и семьи", "animal": "Дельфин"}
    },

    "Какое время суток ты предпочитаешь?": {
        "A": {"text": "Утро", "animal": "Жираф"},
        "B": {"text": "Ночь", "animal": "Манул"},
        "C": {"text": "День", "animal": "Обезьяна"}
    },

    "Что ты делаешь, когда вокруг тишина?" : {
        "A": {"text": "Засыпаю", "animal": "Коала"},
        "B": {"text": "Слушаю", "animal": "Суслик"},
        "C": {"text": "Пою", "animal": "Лев"}
    },

    "Какое дерево ты предпочитаешь для восхождения?" : {
        "A": {"text": "Эвкалипт", "animal": "Коала"},
        "B": {"text": "Пальма", "animal": "Обезьяна"},
        "C": {"text": "Береза", "animal": "Суслик"}
    },

    "Какой вид плодов ты предпочитаешь?" : {
        "A": {"text": "Бананы", "animal": "Обезьяна"},
        "B": {"text": "Эвкалиптовые листья", "animal": "Коала"},
        "C": {"text": "Коренья и орехи", "animal": "Суслик"}
    },



}

